{
  "statusCode": 200,
  "success": true,
  "message": "Portfolio data loaded successfully",
  "data": {
    "personalInfo": {
      "name": "Tayyub Yaqoob",
      "title": "Digital Analyst & AI/ML Solutions Engineer",
      "summary": "I’m a Digital Analyst and AI Engineer with 7+ years of experience turning complex data into insights that drive growth, efficiency, and smarter decision-making. I build AI-powered analytics systems that automate reporting, optimize budgets, and reveal actionable opportunities across marketing and operations. My work helps organizations improve ROI, accelerate performance, and make data-driven decisions with confidence.",
      "image": "/assets/default-avatar.png",
      "phone": "",
      "email": "tayyubyaqoob@gmail.com",
      "location": "Stirling, Scotland, UK"
    },
"experience": [ 
  {
    "company": "8 Million Stories Ltd (8MS)",
    "title": "Digital Analyst",
    "dates": "Apr 2021 – Present",
"achievements": [
      "Partnered with Tesco Bank and BBC World Service to run data-driven campaign analyses and A/B experiments, increasing conversion rates by 17% for Tesco Bank and boosting BBC World Service engagement by 22% through improved audience targeting.",
      "Managed data retainers for Royal London, Gleneagles Hotel, Estelle, and Blue Buffalo, delivering GA4 tracking, GTM implementations, analytics, and campaign optimization that improved ROI by 15%.",
      "Built and deployed automated GA4 → BigQuery → Looker pipelines processing over 200M events per month, reducing manual reporting time by 83%.",
      "Led internal working groups to develop AI-driven data modules for media mix modeling, forecasting, sentiment analysis, and competitor analysis, now deployed across 35 clients.",
      "Implemented Bayesian MMM models improving budget allocation accuracy and delivering a 12% ROAS uplift across multiple clients.",
      "Developed and integrated a Python-based anomaly detection system into Looker dashboards, reducing issue detection time by 85%.",
      "Mentored over 4 junior analysts on cloud architecture, Git version control, and automation workflows, tripling team delivery capacity.",
      "Collaborated with paid media, SEO, and development teams to standardize KPIs and align analytics with strategic decision-making."
    ]
  },
  {
    "company": "Cointelegraph",
    "title": "AI/ML Content Creator (Freelance)",
    "dates": "Apr 2023 – Present",
    "achievements": [
      "Authored over 30 AI and ML research articles reaching more than 1.2M readers worldwide, covering topics such as large language models, AI ethics, and model transparency.",
      "Researched and analyzed AI/ML trends, including LLMs and generative AI, for global editorial coverage.",
      "Translated complex AI/ML concepts into accessible, research-backed articles for both technical and non-technical readers.",
      "Explored AI integration with blockchain and Web3 ecosystems, highlighting use cases and implications for DeFi.",
      "Leveraged data analytics to identify content performance trends and align topics with audience interests.",
      "Collaborated with editorial teams to ensure accuracy, quality, and SEO-aligned relevance."
    ]
  },
  {
    "company": "AlphaWire",
    "title": "Crypto Content Creator (Contract)",
    "dates": "May 2025 – Aug 2025",
    "achievements": [
      "Authored research-backed pieces on blockchain, crypto assets, and fintech integrations with traditional markets.",
      "Transformed emerging financial and regulatory concepts into clear, actionable insights.",
      "Highlighted expertise in AI, data, and blockchain to align technology innovation with business strategy."
    ]
  },
  {
  "company": "Freelance",
  "title": "Data & AI Consultant",
  "dates": "2019 – Present",
  "description": "Provide data analytics, tracking, and AI consulting for global clients across multiple industries, focusing on GA4, GTM, automation, and cloud-based analytics solutions.",
  "achievements": [
    "Delivered GA4 audits, troubleshooting, and end-to-end tracking setups across paid channels including Google Ads, Meta, LinkedIn, and Bing.",
    "Implemented advanced GTM tagging architectures and event tracking for performance and attribution measurement.",
    "Set up and maintained cookie compliance frameworks (GDPR, Consent Mode V2) to ensure privacy-first data collection.",
    "Built automated GA4 → BigQuery → Looker pipelines for marketing and performance reporting.",
    "Worked on data retainers and analytics solutions for clients such as Neilson Holidays, JojoSki, Nerdwallet, Rivet Education, and Clinic Secret."
  ]
},
  {
    "company": "Scholarships Guider",
    "title": "Co-Founder",
    "dates": "Jan 2020 – Apr 2021",
    "achievements": [
      "Founded and managed an educational platform connecting students to global scholarship opportunities.",
      "Built partnerships with universities and organizations to expand the platform’s reach.",
      "Led digital campaigns that increased organic traffic and student engagement."
    ]
  },
  {
    "company": "iVision",
    "title": "Data Analyst",
    "dates": "Jan 2020 – Apr 2021",
    "achievements": [
        "Used machine learning techniques to create scalable solutions for business problems.",
        "Handled large volumes of data across multiple databases, performing ETL operations using SQL to meet client requirements.",
        "Analyzed marketing campaigns across different channels using Google Analytics and delivered key insights to senior stakeholders based on performance KPIs.",
        "Scraped large datasets from multiple websites using Python libraries such as BeautifulSoup to extract and process relevant data.",
        "Implemented Google Tag Manager (GTM) to track and analyze user interactions including banner clicks, registrations, and page visits.",
        "Ensured data consistency, reliability, and quality across multiple reporting pipelines.",
        "Collaborated with business and technical teams to ensure that analytics outputs aligned with marketing goals and decision-making."
      ]
  },
  {
    "company": "Quipsol",
    "title": "Data Analyst",
    "dates": "Aug 2017 – Aug 2018",
    "achievements": [
        "Collaborated with cross-functional teams to identify data requirements and translate them into actionable insights for strategic business decisions.",
        "Developed, maintained, and optimized automated reporting systems and dashboards to streamline data visualization and accessibility for stakeholders.",
        "Designed and executed complex SQL queries to extract, transform, and analyze data from multiple sources, ensuring accuracy and efficiency.",
        "Monitored data pipelines and implemented validation steps to ensure high-quality, reliable reporting outputs.",
        "Analyzed data trends and patterns in large datasets to support forecasting and data-informed decision-making.",
        "Presented insights and recommendations to management, enabling data-backed improvements in process and performance."
      ]
  }
],
    "education": [
      {
    "institution": "University of Stirling",
    "degree": "Masters in Big Data",
    "dates": "2018-2019",
    "location": "Stirling, Scotland, UK"

    },
      {
    "institution": "COMSATS University Islamabad",
    "degree": "BS in Software Engineering",
    "dates": "2013-2017",
    "location": "Islamabad, Pakistan"
      }
    ],
    "projects": [
  {
    "title": "Forecasting Engine (GSC / GA4)",
    "description": "Automated weekly forecasting engine for organic and GA4 traffic across 50+ clients. Generates keyword, query, and total traffic predictions with backtests, confidence intervals, and performance alerts.",
    "technologies": ["Python", "BigQuery", "AWS Lambda", "Prophet", "Pandas", "GitHub Actions"],
    "featured": true
  },
  {
    "title": "Anomaly Detection & Alerting",
    "description": "Anomaly detection framework using precision/recall-tuned thresholds on clicks and sessions. Automatically identifies unusual traffic patterns and sends real-time alerts to teams.",
    "technologies": ["Python", "BigQuery", "Cloud Functions", "Scikit-learn", "AWS SNS"],
    "featured": true
  },
  {
    "title": "Sitemap Similarity Engine",
    "description": "Analyzes and compares website sitemaps (50–100 sites) by extracting and embedding HTML text via SentenceTransformers to measure content overlap and structural similarity.",
    "technologies": ["Python", "SentenceTransformers", "AWS EC2", "BigQuery", "BeautifulSoup"],
    "featured": false
  },
  {
    "title": "Sentiment & Mentions Intelligence",
    "description": "Weekly automated sentiment analysis across online sources, handling client-specific negative keywords. Outputs sentiment and brand mention data to AWS S3 for reporting in Looker.",
    "technologies": ["Python", "VADER", "AWS Lambda", "S3", "Pandas"],
    "featured": false
  },
  {
    "title": "PersonaGraph (Multi-Source)",
    "description": "NLP-based persona generation system that combines Google Knowledge Graph, Wikidata, DBpedia, and Wikipedia data. Uses embeddings and clustering to uncover entity relationships and build topic personas for SEO.",
    "technologies": ["Python", "SentenceTransformers", "Wikidata SPARQL", "Google KG API", "Streamlit"],
    "featured": true
  },
  {
    "title": "Synergy (Paid × Organic Attribution)",
    "description": "Attribution-aware analytics module quantifying overlap and cannibalization between paid and organic channels. Supports data-driven reallocation to maximize blended ROI.",
    "technologies": ["Python", "BigQuery", "NumPy", "Pandas"],
    "featured": false
  },
  {
    "title": "Meridian – MMM",
    "description": "Bayesian Marketing Mix Modeling pipeline for budget optimization. Implements adstock, saturation, and diminishing returns modeling with holdout validation and posterior simulations.",
    "technologies": ["BigQuery", "Python", "Google Meridian"],
    "featured": true
  },
  {
    "title": "Neilson Holidays – Data Retainer",
    "description": "Forecasting, anomaly detection, and GA4 data automation across bookings and traffic. Implemented automated Looker dashboards built on GA4 → BigQuery pipelines.",
    "technologies": ["GA4", "BigQuery", "Python", "Looker Studio"],
    "featured": false
  },
  {
    "title": "Clogau & Clogau Outlet – CRM × GA4 Integration",
    "description": "Connected CRM and GA4 datasets to match enquiries and bookings, enabling automated performance reporting. Implemented Advanced Consent Mode V2 to ensure compliance.",
    "technologies": ["GA4", "BigQuery", "CRM API", "Consent Mode V2", "Supermetrics"],
    "featured": false
  },
  {
    "title": "Rivet Education – Data Retainer",
    "description": "Developed forecasting, sentiment dashboards, and trend analysis pipelines for education sector data. Enabled actionable insight reporting using GA4 and AWS.",
    "technologies": ["Python", "BigQuery", "AWS Lambda", "Looker Studio"],
    "featured": false
  },
  {
    "title": "Tesco Bank – GA4 & MMM Retainer",
    "description": "Delivered end-to-end GA4 audits, GTM automation, and MMM forecasting with budget optimization insights. Enabled advanced tracking and decision-ready dashboards.",
    "technologies": ["GA4", "BigQuery", "Python", "Vertex AI", "GTM"],
    "featured": false
  },
  {
    "title": "Royal London – Insights Automation",
    "description": "Built pipelines for anomaly detection, MMM inputs, and search query forecasting. Automated GA4 audits and integrated outputs into Looker dashboards.",
    "technologies": ["Python", "Vertex AI", "BigQuery", "Looker Studio"],
    "featured": false
  },
  {
    "title": "Stablecoin Depegging Study (2023–2025)",
    "description": "Analyzed USDT, USDC, and DAI stability using CoinGecko API data. Studied depeg events, liquidity effects, and market cap correlations to assess systemic risk in stablecoins.",
    "technologies": ["Python", "CoinGecko API", "Pandas", "Matplotlib", "BigQuery"],
    "featured": true
  },
  {
    "title": "Looker Forecast vs Actuals Dashboard",
    "description": "Automated daily comparison of forecasted vs actual traffic for multiple journey types (consumer, adviser, red routes). Highlights variance and anomalies for reporting accuracy.",
    "technologies": ["BigQuery", "Looker Studio", "Python", "Supermetrics"],
    "featured": false
  },
  {
    "title": "GA4 Superior Audit Template",
    "description": "Comprehensive audit framework for analytics setup validation, covering consent mode, data accuracy, broken tags, and attribution issues.",
    "technologies": ["GA4", "GTM", "BigQuery", "JavaScript"],
    "featured": false
  },
  {
    "title": "AI Mentions Tracker",
    "description": "Automated module to identify AI-related mentions across web and social data. Supports reputation monitoring and competitive benchmarking.",
    "technologies": ["Python", "AWS Lambda", "BigQuery", "VADER", "S3"],
    "featured": false
  },
  {
    "title": "AI Forecasting Dashboard (Vertex AI + BigQuery)",
    "description": "Integrated Vertex AI time series forecasting with BigQuery and Looker for automated campaign-level projections and accuracy evaluation.",
    "technologies": ["Vertex AI", "BigQuery", "Python", "Looker Studio"],
    "featured": true
  },
  {
    "title": "AI News Rundown (Automation Pipeline)",
    "description": "Automated AI news aggregation pipeline inspired by Rundown.ai, using NLP to summarize and categorize industry updates for daily distribution.",
    "technologies": ["Python", "NewsAPI", "OpenAI API", "Streamlit", "AWS Lambda"],
    "featured": false
  },
  {
    "title": "Adverity Migration – PPC Dashboards",
    "description": "Migrated PPC reporting stack from Supermetrics to Adverity + BigQuery. Automated daily data refresh, campaign grouping, and performance reconciliation across multiple markets.",
    "technologies": ["Adverity", "BigQuery", "Looker Studio", "GA4", "GTM"],
    "featured": true
  }
],
    "techStack": [
  { "name": "Python", "icon": "/icons/python.svg", "category": "AI & ML" },
  { "name": "BigQuery", "icon": "/icons/bigquery.svg", "category": "Data Engineering" },
  { "name": "Vertex AI", "icon": "/icons/vertexai.svg", "category": "AI / Cloud" },
  { "name": "AWS", "icon": "/icons/aws.svg", "category": "Cloud Infrastructure" },
  { "name": "GA4", "icon": "/icons/ga4.svg", "category": "Analytics" },
  { "name": "GTM", "icon": "/icons/gtm.svg", "category": "Analytics" },
  { "name": "React", "icon": "/icons/react.svg", "category": "Frontend" },
  { "name": "Next.js", "icon": "/icons/nextjs.svg", "category": "Frontend" },
  { "name": "Looker Studio", "icon": "/icons/looker.svg", "category": "Data Visualization" },
  { "name": "Supermetrics", "icon": "/icons/supermetrics.svg", "category": "Automation" }
],
    "socialLinks": {
      "github": "https://github.com/tayyub-ai",
      "linkedin": "https://www.linkedin.com/in/tayyubyaqoob",
      "twitter": "",
      "website": "https://www.tayyubyaqoob.com/"
    },
    "resumeUrl": "/resume/resume.pdf",
    "insights": {
      "mostUsedLanguage": "Python",
      "preferredStack": "AI/ML + Cloud",
      "learningFocus": "Health data science and NHS digital tools",
      "careerTrajectory": "Evolving from marketing analytics to clinical/health data AI."
    },
    "githubStats": {
      "totalPublicRepos": 7,
      "totalStars": 12,
      "totalForks": 20,
      "totalCommits": 130,
      "featuredRepos": 5
    }
  }
}
